#include <iostream>
using namespace std;

int main()
{
    setlocale(LC_ALL, "ru");
    int a;
    cout << "Введите число в диапазоне от 1 до 999: ";
    cin >> a;
    if (a % 2 == 0 && a > 0 && a < 10) 
    {
        cout << "Число " << a << " четное и однозначное";
    }
    else if (a % 2 == 0 && a > 9 && a < 100)
    {
        cout << "Число " << a << " четное и двузначное";
    }
    else if (a % 2 == 0 && a > 99 && a < 1000)
    {
        cout << "Число " << a << " четное и трехзначное";
    }
    else if (a % 2 != 0 && a > 0 && a < 10)
    {
        cout << "Число " << a << " нечетное и однозначное";
    }
    else if (a % 2 != 0 && a > 9 && a < 100)
    {
        cout << "Число " << a << " нечетное и двузначное";
    }
    else if (a % 2 != 0 && a > 99 && a < 1000)
    {
        cout << "Число " << a << " нечетное и трехзначное";
    }
    return 0;
}

